Dynamo.Graph.NodeGraph.LoadNodeFromXml(System.Xml.XmlElement,Dynamo.Graph.SaveContext,Dynamo.Graph.Nodes.NodeLoaders.NodeFactory,ProtoCore.Namespace.ElementResolver)
Creates and initializes a NodeModel from its Xml representation.
elNode: XmlElement for a NodeModel.
context: The serialization context for initialization.
nodeFactory: A NodeFactory, to be used to create the node.
Returns:

Dynamo.Graph.NodeGraph.LoadGraphFromXml(System.Xml.XmlDocument,Dynamo.Graph.Nodes.NodeLoaders.NodeFactory)
Loads NodeModels, ConnectorModels, and NoteModels from an XmlDocument.
xmlDoc: An XmlDocument representing a serialized Dynamo workspace.
nodeFactory: A NodeFactory, used to load and instantiate nodes.
elementResolver:
Returns: