Dynamo.Search.SearchElements.NodeSearchElement.IsVisibleInSearch
Specified whether or not this entry should appear in search.

Dynamo.Search.SearchElements.NodeSearchElement.Assembly
Group to which Node belongs to