Dynamo.Graph.Annotations.AnnotationModel.#ctor(System.Collections.Generic.IEnumerable{Dynamo.Graph.Nodes.NodeModel},System.Collections.Generic.IEnumerable{Dynamo.Graph.Notes.NoteModel})
Initializes a new instance of the Dynamo.Graph.Annotations.AnnotationModel class.
nodes: The nodes.
notes: The notes.
loadFromGraph: This is true when graph is loaded from XML

Dynamo.Graph.Annotations.AnnotationModel.model_Disposed(Dynamo.Graph.ModelBase)
Recalculate the group when a node is disposed
node: The node.

Dynamo.Graph.Annotations.AnnotationModel.CalculateWidthAndHeight
Group the Models based on Height and Width
Returns:  the width and height of the last model

Dynamo.Graph.Annotations.AnnotationModel.Rect
Overriding the Rect from Modelbase
This gets the actual RECT of the group.
This is required to make the group as ILocatable.