Dynamo.Models.DynamoModel.Start
Start DynamoModel with all default configuration options
Returns:

Dynamo.Models.DynamoModel.Start(Dynamo.Models.DynamoModel.IStartConfiguration)
Start DynamoModel with custom configuration.  Defaults will be assigned not provided.
configuration:
Returns:

Dynamo.Models.DynamoModel.UpdateCustomNodeDefinition(Dynamo.CustomNodeDefinition)
Register custom node defintion and execute all custom node
instances.
?:

Dynamo.Models.DynamoModel.MarkAllDependenciesAsModified(Dynamo.CustomNodeDefinition)
Get all function instances or directly or indrectly dependo on the
specified function definition and mark them as modified so that
their values will be re-queryed.
functionId:
Returns:

Dynamo.Models.DynamoModel.ResetEngine(System.Boolean)
Call this method to reset the virtual machine, avoiding a race
condition by using a thread join inside the vm executive.
TODO(Luke): Push this into a resync call with the engine controller
Tracked in MAGN-5167.
As some async tasks use engine controller, for example
CompileCustomNodeAsyncTask and UpdateGraphAsyncTask, it is possible
that engine controller is reset *before* tasks get executed. For
example, opening custom node will schedule a CompileCustomNodeAsyncTask
firstly and then reset engine controller.
We should make sure engine controller is reset after all tasks that
depend on it get executed, or those tasks are thrown away if safe to
do that.
markNodesAsDirty: Set this parameter to true to force
reset of the execution substrait. Note that setting this parameter
to true will have a negative performance impact.

Dynamo.Models.DynamoModel.OpenFileFromPath(System.String,System.Boolean)
Opens a Dynamo workspace from a path to an Xml file on disk.
xmlPath:

Dynamo.Models.DynamoModel.AddCustomNodeWorkspace(Dynamo.Graph.Workspaces.CustomNodeWorkspaceModel)
Add a new, visible Custom Node workspace to Dynamo
workspace:

Dynamo.Models.DynamoModel.RemoveWorkspace(Dynamo.Graph.Workspaces.WorkspaceModel)
Remove a workspace from the dynamo model.
workspace:

Dynamo.Models.DynamoModel.OpenCustomNodeWorkspace(System.Guid)
Opens an existing custom node workspace.
guid:
Returns:

Dynamo.Models.DynamoModel.AddNodeToCurrentWorkspace(Dynamo.Graph.Nodes.NodeModel,System.Boolean,System.Boolean)
Adds a node to the current workspace.
node:
centered: