Dynamo.Updates.UpdateManagerConfiguration
Defines Update Manager Configuration settings.

Dynamo.Updates.UpdateManagerConfiguration.Load(System.String,Dynamo.Updates.IUpdateManager)
Loads the configurations from given xml file.
filePath: Xml file path that contains configuration details.
updateManager:
Returns: UpdateManagerConfiguration

Dynamo.Updates.UpdateManagerConfiguration.Save(System.String,Dynamo.Updates.IUpdateManager)
Saves this configuration to a given file in xml format.
filePath: File path to save this configuration.
updateManager:

Dynamo.Updates.UpdateManagerConfiguration.GetSettings(Dynamo.Updates.IDynamoLookUp,Dynamo.Updates.IUpdateManager)
Utility method to get the settings
lookUp: IDynamoLookUp instance
updateManager:
Returns:

Dynamo.Updates.UpdateManagerConfiguration.TryGetConfigFilePath(System.String@)
Gets the update manager config file path.
filePath: Full path for the config file
Returns: True if file exists.

Dynamo.Updates.UpdateManagerConfiguration.DownloadSourcePath
Defines download location for new installer

Dynamo.Updates.UpdateManagerConfiguration.SignatureSourcePath
Defines location for signature file to validate the new installer.

Dynamo.Updates.UpdateManagerConfiguration.CheckNewerDailyBuild
Defines whether to consider daily builds for update, default is false.

Dynamo.Updates.UpdateManagerConfiguration.ForceUpdate
Defines whether to force update, default vlaue is false.

Dynamo.Updates.UpdateManagerConfiguration.InstallerNameBase
Gets the base name of the installer to be used for upgrade.