Dynamo.Graph.Nodes.ScopedNodeModel.GetInScopeNodesForInport(System.Int32,System.Boolean,System.Boolean,System.Boolean)
Get all nodes that in its input ports's scope. A node is in its
scope if that node is one of its upstream nodes.
portIndex: Inport index
checkEscape:
If need to exclude nodes that one of their downstream nodes are not
in the scope
isInclusive:
If a upstream node is ScopedNodeModel, need to include all upstream
nodes of that node.
Returns:

Dynamo.Graph.Nodes.ScopedNodeModel.GetInScopeNodes(System.Boolean,System.Boolean)
Return all nodes that are in the scope of this node.
nodes are not in the scope.
checkEscape:
Specifies if need to exclude nodes that one of their downstream
nodes are not in the scope
isInclusive:
If one of its upstream node is ScopedNodeModel, if need to include
all upstream nodes of that node.
Returns: