Dynamo.Engine.NodeToCode.NodeToCodeCompiler.VariableNumbering(ProtoCore.Core,ProtoCore.AST.AssociativeAST.AssociativeNode,Dynamo.Graph.Nodes.NodeModel,System.Collections.Generic.Dictionary{System.String,Dynamo.Engine.NodeToCode.NodeToCodeCompiler.NumberingState},System.Collections.Generic.Dictionary{System.String,System.String},System.Collections.Generic.Dictionary{System.String,System.String},System.Collections.Generic.Dictionary{System.String,System.String},System.Collections.Generic.HashSet{System.String})
Renumber variables used in astNode.
astNode:
numberingMap:
variableMap:

Dynamo.Engine.NodeToCode.NodeToCodeCompiler.VariableRemapping(ProtoCore.Core,ProtoCore.AST.AssociativeAST.AssociativeNode,System.Collections.Generic.Dictionary{System.String,System.String},System.Collections.Generic.Dictionary{System.String,System.String},System.Collections.Generic.HashSet{System.String})
Remap variables.
astNode:
renamingMap:

Dynamo.Engine.NodeToCode.NodeToCodeCompiler.GetNextShortName(Dynamo.Engine.NodeToCode.NodeToCodeCompiler.TypeDependentNameGenetrator,System.Collections.Generic.Dictionary{System.String,ProtoCore.Type},System.Collections.Generic.HashSet{System.String},System.String)
Get type-dependent short name based on the type hint of input variable
generator:
typeHints:
mappedVariables:
varName:
Returns:

Dynamo.Engine.NodeToCode.NodeToCodeCompiler.ConstantPropagationForTemp(Dynamo.Engine.NodeToCode.NodeToCodeResult,System.Collections.Generic.IEnumerable{System.String})
Remove temporary assignment from the result. That is, removing
assignment "t1 = x" where t1 is a temporary variable. This kind
of assginment can be safely removed, but now all nodes that
connect to "t1" should re-connect to "x". For example, "a = t1"
now should be updated to "a = x".
result:
Returns: