Dynamo.Engine.EngineController
A controller to coordinate the interactions between some DesignScript
sub components like library managment, live runner and so on.

Dynamo.Engine.EngineController.GetFunctionGroups
Return all function groups.

Dynamo.Engine.EngineController.ImportLibrary(System.String)
Import library.
library:

Dynamo.Engine.EngineController.GetMirror(System.String)
Get runtime mirror for variable.
variableName:
Returns:

Dynamo.Engine.EngineController.GetGraphicItems(System.String)
Get a list of IGraphicItem of variable if it is a geometry object;
otherwise returns null.
variableName:
Returns:

Dynamo.Engine.EngineController.GenerateGraphSyncData(System.Collections.Generic.ICollection{Dynamo.Graph.Nodes.NodeModel},System.Boolean)
Generate graph sync data based on the input Dynamo nodes. Return
false if all nodes are clean.
nodes:
verboseLogging:
Returns:

Dynamo.Engine.EngineController.PreviewGraphSyncData(System.Collections.Generic.IEnumerable{Dynamo.Graph.Nodes.NodeModel},System.Boolean)
This is called on the main thread from PreviewGraphSyncData
to generate the list of node id's that will be executed on the next run
updatedNodes: The updated nodes.
Returns: This method returns the list of all reachable node id's from the given
updated nodes

Dynamo.Engine.EngineController.GenerateGraphSyncDataForCustomNode(System.Collections.Generic.IEnumerable{Dynamo.Graph.Nodes.NodeModel},Dynamo.CustomNodeDefinition,System.Boolean)
Generate graph sync data based on the input Dynamo custom node information.
Return false if all nodes are clean.
nodes:
definition:
verboseLogging:
Returns:

Dynamo.Engine.EngineController.UpdateGraph(System.Collections.Generic.ICollection{Dynamo.Graph.Nodes.NodeModel},System.Exception@)
Update graph with graph sync data.
nodes:
fatalException: The exception that is not handled
anywhere within the LiveRunnerServices.UpdateGraph method. This
parameter will always be set to null if there is no unhandled
exception thrown from within the UpdateGraph call.
Returns: Returns true if any update has taken place, or false
otherwise.

Dynamo.Engine.EngineController.LiveRunnerCore
Get DesignScript core.

Dynamo.Engine.EngineController.LiveRunnerRuntimeCore
Get DesignScript runtime core.

Dynamo.Engine.EngineController.LibraryServices
Return libary service instance.

Dynamo.Engine.EngineController.HasPendingGraphSyncData
Return true if there are graph sync data in the queue waiting for
being executed.
Returns: