Dynamo.Graph.Nodes.Statement.GetReferencedVariableNames(Dynamo.Graph.Nodes.Statement,System.Boolean)
Returns the names of the variables that have been referenced in the statement
s:  Statement whose variable names to be got.
onlyTopLevel:  Bool to check if required to return reference variables in sub statements as well
Returns:

Dynamo.Graph.Nodes.Statement.GetDefinedVariableNames(Dynamo.Graph.Nodes.Statement,System.Boolean)
Returns the names of the variables that have been declared in the statement
s:  Statement whose variable names to be got.
onlyTopLevel:  Bool to check if required to return reference variables in sub statements as well
Returns: