Dynamo.Graph.Nodes.NodeLoaders.NodeFactory.CreateProxyNodeInstance(System.Guid,System.String,System.String,System.Int32,System.Int32)
A proxy custom node is a custom node without its definition loaded
in Dynamo. The creation of a proxy custom node relies on information
provided by the caller since the definition is not readily available
for reading. The actual definition may become available at a later
time by means of user uploading the definition.
id: Identifier of the custom node instance.
name: The name represents the GUID of the custom node
definition that is used for creating the custom node instance.
nickName: The display name of the custom node.
inputs: Number of input ports.
outputs: Number of output ports.
Returns: Returns the custom node instance if creation was successful,
or null otherwise.

Dynamo.Graph.Nodes.NodeLoaders.NodeFactory.ResolveType(System.String,System.Type@)
Given a type name, attempts to get the type associated with that name.
fullyQualifiedName:
type:
Returns:

Dynamo.Graph.Nodes.NodeLoaders.NodeFactory.CreateNodeFromXml(System.Xml.XmlElement,Dynamo.Graph.SaveContext,ProtoCore.Namespace.ElementResolver)
Creates and Loads a new NodeModel from its Serialized form, using the node loaders
registered in this factory. If loading fails, a Dummy Node is produced.
elNode:
context:
Returns: