Dynamo.Core.DynamoMigratorBase
Base class for all versions of Dynamo classes relating to
migrating preferences, packages and definitions from older versions
For version specific migration, derived classes will override base class methods
The naming convention for derived classes is "DynamoMigrator{MajorVersion}{MinorVersion}"
For e.g. derived migrator class for verion 0.7 is "DynamoMigrator07"
Derived migrator class for version 0.8 is "DynamoMigrator08" and so on.
Constructors of classes derived from DynamoMigratorBase need to be public
as their instances are created through reflection.

Dynamo.Core.DynamoMigratorBase.MigrateFrom(Dynamo.Core.DynamoMigratorBase)
Migrates preference settings, packages, custom node definitions, etc.
from source migrator version to current version.
This function can be overridden by version specific migrator classes
sourceMigrator:  source migrator version from which to migrate from
///
Returns: new migrator instance after migration

Dynamo.Core.DynamoMigratorBase.MigrateBetweenDynamoVersions(Dynamo.Interfaces.IPathManager,Dynamo.Interfaces.IPathResolver)
Migrates preference settings and copies packages and custom node
definitions from the last but one version to the currently installed Dynamo version
pathManager:
pathResolver:
Returns: new migrator instance after migration

Dynamo.Core.DynamoMigratorBase.GetInstalledVersions(System.String)
Get a list of file version objects given a root folder. Assuming the
following folders exist:
e:\some\path\0.4
e:\some\path\0.75
e:\some\path\1.82
Calling this method with "e:\\some\\path" would return an ordered
list in the following way (from largest number to smallest number):
{ FileVersion(1, 82), FileVersion(0, 75), FileVersion(0, 4) }
rootFolder: The root folder under which versioned sub-
folders are expected to be found. This argument must represent a valid
local directory.
Returns: Return a list of FileVersion objects, ordered by newest
version to the oldest version. If no versioned sub-folder exists, then
the returned list is empty.
Throws System.ArgumentNullException: This exception is
thrown if rootFolder is null or an empty string.
Throws System.IO.DirectoryNotFoundException: This exception
is thrown if rootFolder points to an invalid directory.

Dynamo.Core.DynamoMigratorBase.Migrate(Dynamo.Interfaces.IPathResolver,Dynamo.Core.FileVersion,Dynamo.Core.FileVersion)
Given a root user data directory, this migrates user preferences,
packages and custom node definition files from one installed version
into another
pathResolver:
fromVersion:  source Dynamo version from which to migrate
toVersion:  target Dynamo version into which to migrate
Returns:  new migrator instance after migration, null if there's no migration

Dynamo.Core.DynamoMigratorBase.CreateMigrator(Dynamo.Interfaces.IPathResolver,Dynamo.Core.FileVersion)
Given a root user directory, this creates an instance of the migrator
depending on the input version using reflection. Returns the default
migrator (DynamoMigratorBase) if version specific migrator does not exist
pathResolver:
version:  input version for which migrator instance is created
Returns:  instance of migrator specific to input version.