Dynamo.Graph.Nodes.PortModel.OnPortConnected(Dynamo.Graph.Connectors.ConnectorModel)
Called when a port is connected.
connector:

Dynamo.Graph.Nodes.PortModel.OnPortDisconnected
Called when a port is disconnected.
e:

Dynamo.Graph.Nodes.PortModel.PortConnected
Event triggered when a port is connected.

Dynamo.Graph.Nodes.PortModel.PortDisconnected
Event triggered when a port is disconnected.

Dynamo.Graph.Nodes.PortModel.IsConnected
A flag indicating whether the port is considered connected.

Dynamo.Graph.Nodes.PortModel.DefaultValueEnabled
Controls whether the Use Default Value option is available.