Dynamo.Engine.LiveRunnerServices.GetMirror(System.String,System.Boolean)
TPDP
var:
verboseLogging:
Returns:

Dynamo.Engine.LiveRunnerServices.PreviewGraph(ProtoScript.Runners.GraphSyncData,System.Boolean)
Preview graph with graph sync data.
graphData:

Dynamo.Engine.LiveRunnerServices.GetRuntimeWarnings
Return runtime warnings for this run.
Returns:

Dynamo.Engine.LiveRunnerServices.GetBuildWarnings
Return build warnings for this run.
Returns:

Dynamo.Engine.LiveRunnerServices.GetExecutedAstGuids(System.Guid)
Return GUIDs of exectued ASTs in this run.
sessionID:
Returns:

Dynamo.Engine.LiveRunnerServices.GraphUpdateReady(System.Object,ProtoScript.Runners.GraphUpdateReadyEventArgs)
GraphUpdateReady event handler.
sender:
e:

Dynamo.Engine.LiveRunnerServices.NodeValueReady(System.Object,ProtoScript.Runners.NodeValueReadyEventArgs)
NodeValueReady event handler.
sender:
e: