Dynamo.Scheduler.DynamoScheduler.ProcessMode
Flag determining whether or not the scheduleed task will be
processed immediately or not.

Dynamo.Scheduler.DynamoScheduler.HasPendingTasks
Return true if task queue is not empty.