Dynamo.Models.DynamoModel.UpdateModelValueCommand.#ctor(System.Guid,System.Collections.Generic.IEnumerable{System.Guid},System.String,System.String)
workspaceGuid: Guid of the target workspace. Guid.Empty means current workspace
modelGuids:
name:
value: