Dynamo.Scheduler.UpdateGraphAsyncTask.Contains(Dynamo.Scheduler.UpdateGraphAsyncTask)
Return if this task's graph sync data is a super set of the other
other:
Returns:

Dynamo.Scheduler.UpdateGraphAsyncTask.GetDownstreamNodes(Dynamo.Graph.Nodes.NodeModel,System.Collections.Generic.ICollection{Dynamo.Graph.Nodes.NodeModel})
Call this method to recursively gather downstream nodes of a given node.
Get only those nodes that are in RUN state.
node: A NodeModel whose downstream nodes are to be gathered.
gathered: A list of all downstream nodes.