Dynamo.Configuration.PreferenceSettings
PreferenceSettings is a class for GUI to persist certain settings.
Upon running of the GUI, those settings that are persistent will be loaded
from a XML file from DYNAMO_SETTINGS_FILE.
When GUI is closed, the settings into the XML file.

Dynamo.Configuration.PreferenceSettings.Save(System.String)
Save PreferenceSettings in XML File Path if possible,
else return false
filePath: Path of the XML File
Returns: Whether file is saved or error occurred.

Dynamo.Configuration.PreferenceSettings.SaveInternal(System.String)
Save PreferenceSettings in a default directory when no path is
specified.
preferenceFilePath: The file path to save preference
settings to. If this parameter is null or empty string, preference
settings will be saved to the default path.
Returns: Whether file is saved or error occurred.

Dynamo.Configuration.PreferenceSettings.Load(System.String)
Return PreferenceSettings from XML path if possible,
else return PreferenceSettings with default values
filePath: Path of the XML File
Returns:
Stored PreferenceSettings from xml file or
Default PreferenceSettings if xml file is not found.

Dynamo.Configuration.PreferenceSettings.IsBackgroundPreviewActive
Should the background 3D preview be shown?

Dynamo.Configuration.PreferenceSettings.CustomPackageFolders
A list of folders containing zero-touch nodes and custom nodes.