Dynamo.Logging.DynamoLogger.#ctor(Dynamo.Configuration.DebugSettings,System.String)
The default constructor.

Dynamo.Logging.DynamoLogger.Log(System.String,Dynamo.Logging.LogLevel,System.Boolean)
Log the message to the the correct path
message:

Dynamo.Logging.DynamoLogger.Log(System.String)
Log a message
message:

Dynamo.Logging.DynamoLogger.Log(System.Exception)
Log an exception
e:

Dynamo.Logging.DynamoLogger.Log(System.String,System.String)
Log some data with an associated tag
tag:
data:

Dynamo.Logging.DynamoLogger.StartLogging(System.String)
Begin logging.