Dynamo.Graph.Presets.PresetModel.#ctor(System.String,System.String,System.Collections.Generic.IEnumerable{Dynamo.Graph.Nodes.NodeModel})
create a new presetsState, this will serialize all the referenced nodes by calling their serialize method,
the resulting XML elements will be used to save this state when the presetModel is saved on workspace save
name: name for the state, must not be null
description: description of the state, can be null
inputsToSave: set of nodeModels, must not be null
id: an id GUID, can be empty GUID

Dynamo.Graph.Presets.PresetModel.Nodes
list of nodemodels that this state serializes

Dynamo.Graph.Presets.PresetModel.SerializedNodes
list of serialized nodes