Dynamo.Updates.IUpdateManagerConfiguration.DownloadSourcePath
Defines download location for new installer

Dynamo.Updates.IUpdateManagerConfiguration.SignatureSourcePath
Defines location for signature file to validate the new installer.

Dynamo.Updates.IUpdateManagerConfiguration.CheckNewerDailyBuild
Defines whether to consider daily builds for update, default is false.

Dynamo.Updates.IUpdateManagerConfiguration.ForceUpdate
Defines whether to force update, default vlaue is false.

Dynamo.Updates.IUpdateManagerConfiguration.InstallerNameBase
Gets the base name of the installer to be used for upgrade.

Dynamo.Updates.IUpdateManagerConfiguration.DynamoLookUp
Gets IDynamoLookUp interface to search Dynamo installations on the system.