Dynamo.Core.CustomNodeManager.GetWorkspaceById(System.Guid)
Gets custom node workspace by a specified custom node ID
customNodeId: Custom node ID of a requested workspace
Returns: Custom node workspace by a specified ID

Dynamo.Core.CustomNodeManager.CreateCustomNodeInstance(System.Guid,System.String,System.Boolean)
Creates a new Custom Node Instance.
id: Identifier referring to a custom node definition.
nickname:
Nickname for the custom node to be instantiated, used for error recovery if
the given id could not be found.
isTestMode:
Flag specifying whether or not this should operate in "test mode".

Dynamo.Core.CustomNodeManager.GuidFromPath(System.String)
Get a function id from a guid assuming that the file is already loaded.
path:
Returns:

Dynamo.Core.CustomNodeManager.SetNodeInfo(Dynamo.CustomNodeInfo)
Stores the path and function definition without initializing a node.  Overwrites
the existing NodeInfo if necessary

Dynamo.Core.CustomNodeManager.TryGetFunctionWorkspace(System.Guid,System.Boolean,Dynamo.Graph.Workspaces.CustomNodeWorkspaceModel@)
Get the function workspace from a guid
id: The unique id for the node.
isTestMode:
Flag specifying whether or not this should operate in "test mode".
ws:
Returns: The path to the node or null if it wasn't found.

Dynamo.Core.CustomNodeManager.TryGetFunctionDefinition(System.Guid,System.Boolean,Dynamo.CustomNodeDefinition@)
Get the function definition from a guid.
id: Custom node identifier.
isTestMode:
Flag specifying whether or not this should operate in "test mode".
definition:
Returns:

Dynamo.Core.CustomNodeManager.Contains(System.Guid)
Tells whether the custom node's unique identifier is inside of the manager (initialized or not)
guid: The FunctionId

Dynamo.Core.CustomNodeManager.Contains(System.String)
Tells whether the custom node's name is inside of the manager (initialized or not)
name: The name of the custom node.

Dynamo.Core.CustomNodeManager.IsInitialized(System.String)
Tells whether the custom node is initialized in the manager
name: The name of the node
Returns: The name of the

Dynamo.Core.CustomNodeManager.IsInitialized(System.Guid)
Tells whether the custom node is initialized in the manager
guid: Whether the definition is stored with the manager.

Dynamo.Core.CustomNodeManager.TryGetInfoFromPath(System.String,System.Boolean,Dynamo.CustomNodeInfo@)
Get a guid from a specific path, internally this first calls GetDefinitionFromPath
path: The path from which to get the guid
isTestMode:
Flag specifying whether or not this should operate in "test mode".
info:
Returns: The custom node info object - null if we failed

Dynamo.Core.CustomNodeManager.OpenCustomNodeWorkspace(System.Xml.XmlDocument,Dynamo.Graph.Workspaces.WorkspaceInfo,System.Boolean,Dynamo.Graph.Workspaces.WorkspaceModel@)
Opens a Custom Node workspace from an XmlDocument, given a pre-constructed WorkspaceInfo.
xmlDoc: XmlDocument representing the parsed custom node file.
workspaceInfo: Workspace header describing the custom node file.
isTestMode:
Flag specifying whether or not this should operate in "test mode".
workspace:
Returns:

Dynamo.Core.CustomNodeManager.InitializeCustomNode(System.Guid,System.Boolean,Dynamo.Graph.Workspaces.CustomNodeWorkspaceModel@)
Deserialize a function definition from a given path.  A side effect of this function is that
the node is added to the dictionary of loadedNodes.
functionId: The function guid we're currently loading
isTestMode:
workspace: The resultant function definition
Returns:

Dynamo.Core.CustomNodeManager.Collapse(System.Collections.Generic.IEnumerable{Dynamo.Graph.Nodes.NodeModel},Dynamo.Graph.Workspaces.WorkspaceModel,System.Boolean,Dynamo.Models.FunctionNamePromptEventArgs)
Collapse a set of nodes in a given workspace.
selectedNodes:  The function definition for the user-defined node
currentWorkspace:  The workspace where
isTestMode:
args: