Dynamo.Interfaces.IPathManager.AddResolutionPath(System.String)
Call this method to add additional path for consideration when path
resolution take place.
path: The full path to be considered when PathManager
attempt to resolve a file path. If this argument does not represent
a valid directory path, this method throws an exception.

Dynamo.Interfaces.IPathManager.DefinitionDirectories
Directories from where custom nodes are to be loaded. The implementor
of this interface method should always guarantee that a non-empty
list is returned, and that the first entry represents the default
custom node directory. Custom nodes created are stored in the
default directory, which is specific to the current user. Changes to
custom nodes may or may not be saved to their current location depeding
on write access.

Dynamo.Interfaces.IPathManager.ExtensionsDirectory
The directory, which contains ExtensionDefinition .xml files

Dynamo.Interfaces.IPathManager.ViewExtensionsDirectory
The directory, which contains ViewExtensionDefinition.xml files

Dynamo.Interfaces.IPathManager.GalleryFilePath
Full path to the GalleryContent xml file. The file is located in
the AppData/Dynamo/version/locale/