Dynamo.Search.NodeSearchModel.DumpLibraryToXml(System.String)
Dumps the contents of search into an Xml file.
fileName:

Dynamo.Search.NodeSearchModel.ComposeXmlForLibrary
Serializes the contents of search into Xml.
Returns: