Dynamo.Search.BrowserItem._height
The height of the element in search

Dynamo.Search.BrowserItem._visibility
Whether the item is visible or not

Dynamo.Search.BrowserItem._isSelected
Whether the item is selected or not

Dynamo.Search.BrowserItem._isExpanded
Is the element expanded in the browser