Dynamo.Graph.Nodes.CustomNodes.Function.LoadNode(System.Guid,System.Int32,System.Int32)
Complete a definition for a proxy custom node instance
by adding input and output ports as far as we don't have
a corresponding custom node workspace
funcID: Identifier of the custom node instance
inputs: Number of inputs
outputs: Number of outputs