Dynamo.Updates.UpdateManager.UpdateDataAvailable(Dynamo.Updates.IAsynchronousRequest)
Callback for the UpdateRequest's UpdateDataAvailable event.
Reads the request's data, and parses for available versions.
If a more recent version is available, the UpdateInfo object
will be set.
request: An instance of an update request.

Dynamo.Updates.UpdateManager.GetLatestBuildFromS3(Dynamo.Updates.IAsynchronousRequest,System.Boolean)
Get the file name of the latest build on S3
request:
Returns:

Dynamo.Updates.UpdateManager.GetBuildTimeFromFilePath(System.String,System.String)
Get a build time from a file path.
filePath:
Returns: A DateTime or the DateTime MinValue.

Dynamo.Updates.UpdateManager.GetCurrentBinaryVersion
Get a binary version for the executing assembly
Returns: A BinaryVersion

Dynamo.Updates.UpdateManager.GetBinaryVersionFromFilePath(System.String,System.String)
Get a BinaryVersion from a file path.
installNameBase: The base install name.
filePath: The path name of the file.
Returns: A BinaryVersion or null if one can not be parse from the file path.

Dynamo.Updates.UpdateManager.CheckForProductUpdate(Dynamo.Updates.IUpdateManager)
Checks for the product update by requesting for update version info
from configured download source path. This method will skip the
update check if a newer version of the product is already installed.
manager: Update manager instance using which product
update check nees to be done.