Dynamo.Graph.Workspaces.IWorkspaceModel.RecordModelsForModification(System.Collections.Generic.IEnumerable{Dynamo.Graph.ModelBase})
Implement to record node modification for undo/redo
models:

Dynamo.Graph.Workspaces.IWorkspaceModel.Name
Name of the workspace

Dynamo.Graph.Workspaces.IWorkspaceModel.Description
Gets description of the workspace

Dynamo.Graph.Workspaces.IWorkspaceModel.FileName
Gets FileName of the workspace

Dynamo.Graph.Workspaces.IWorkspaceModel.Connectors
Gets list of connectors in the workspace

Dynamo.Graph.Workspaces.IWorkspaceModel.Nodes
Gets list of nodes owned by this workspace.

Dynamo.Graph.Workspaces.IWorkspaceModel.CurrentSelection
Gets list of selected nodes.