Dynamo.Updates.UpdateRequest.ReadResult(System.Object,System.Net.OpenReadCompletedEventArgs)
Event handler for the web client's requestion completed event. Reads
the request's result information and subsequently triggers
the UpdateDataAvailable event.
sender:
e: