Dynamo.Graph.ModelBase.SetSize(System.Double,System.Double)
Set the width and the height of the node model
and report once.
w:
h:

Dynamo.Graph.ModelBase.HandleModelEvent(System.String,Dynamo.Core.UndoRedoRecorder)
This method is currently used as a way to send an event to ModelBase
derived objects. Its primary use is in DynamoNodeButton class, which
sends this event when clicked.
eventName: The name of the event.
recorder:
Returns: Returns true if the call has been handled, or false otherwise.

Dynamo.Graph.ModelBase.Height
The height of the node.

Dynamo.Graph.ModelBase.Width
The width of the node.