Dynamo.Updates.IDynamoLookUp.GetDynamoInstallLocations
Gets installation path for all version of this Dynamo Product
installed on this system.

Dynamo.Updates.IDynamoLookUp.LatestProduct
Gets the version of latest installed product