Dynamo.Graph.Nodes.CodeBlockNodeModel.GetInportIndex(Dynamo.Graph.Nodes.CodeBlockNodeModel,System.String)
Returns the index of the port corresponding to the variable name given
variableName:  Name of the variable corresponding to an input port
Returns:  Index of the required port in the InPorts collection

Dynamo.Graph.Nodes.CodeBlockNodeModel.GetOutportIndex(System.String)
Returns the corresponding output port index for a given defined variable
variableName:
Returns:

Dynamo.Graph.Nodes.CodeBlockNodeModel.GetTypeHintForOutput(System.Int32)
Return possible type of the output at specified output port.
index:
Returns:

Dynamo.Graph.Nodes.CodeBlockNodeModel.SaveAndDeleteConnectors(System.Collections.IDictionary,System.Collections.IDictionary)
Deletes all the connections and saves their data (the start and end port)
so that they can be recreated if needed.
inportConnections: A list of connections that will be destroyed
outportConnections:

Dynamo.Graph.Nodes.CodeBlockNodeModel.LoadAndCreateConnectors(System.Collections.Specialized.OrderedDictionary,System.Collections.Specialized.OrderedDictionary)
Now that the portData has been set for the new ports, we recreate the connections we
so mercilessly destroyed, restoring peace and balance to the world once again.
inportConnections:
outportConnections:  List of the connections that were killed

Dynamo.Graph.Nodes.CodeBlockNodeModel.TempVariables
Temporary variables that generated in code.