Dynamo.Engine.LibraryServices.UpdateLibraryCoreData
Copy properties from the liveCore
The properties to copy are only those used by the library core

Dynamo.Engine.LibraryServices.GetFunctionGroups(System.String)
Get function groups from an imported library.
library: Library path
Returns:

Dynamo.Engine.LibraryServices.GetAllFunctionGroups
Return all function groups.

Dynamo.Engine.LibraryServices.GetFunctionDescriptor(System.String,System.String)
Get function descriptor from the managled function name.
name.
library: Library path
mangledName: Mangled function name
Returns:

Dynamo.Engine.LibraryServices.GetFunctionDescriptor(System.String)
Get function descriptor from the managed function name.
managledName:
Returns:

Dynamo.Engine.LibraryServices.ImportLibrary(System.String)
Import a library (if it hasn't been imported yet).
library:

Dynamo.Engine.LibraryServices.PopulatePreloadLibraries
Polulate preloaded libraries.

Dynamo.Engine.LibraryServices.ImportedLibraries
Get a list of imported libraries.

Dynamo.Engine.LibraryServices.BuiltinFunctionGroups
Get builtin function groups.
Returns:

Dynamo.Engine.LibraryServices.ImportedFunctionGroups
Get all imported function groups.