Dynamo.Graph.Workspaces.WorkspaceModel.OnRequestNodeCentered(System.Object,Dynamo.Models.ModelEventArgs)
Requests that a Node or Note model should be centered.
sender:
e:

Dynamo.Graph.Workspaces.WorkspaceModel.OnZoomChanged(System.Object,Dynamo.Models.ZoomEventArgs)
Used during open and workspace changes to set the zoom of the workspace
sender:
e:

Dynamo.Graph.Workspaces.WorkspaceModel.OnCurrentOffsetChanged(System.Object,Dynamo.Models.PointEventArgs)
Used during open and workspace changes to set the location of the workspace
sender:
e:

Dynamo.Graph.Workspaces.WorkspaceModel.RecordModelsForModification(System.Collections.Generic.IEnumerable{Dynamo.Graph.ModelBase})
Implement to record node modification for undo/redo
models:

Dynamo.Graph.Workspaces.WorkspaceModel.LayoutSubgraphs
List of subgraphs for graph layout algorithm.

Dynamo.Graph.Workspaces.WorkspaceModel.SubgraphClusters
List of clusters (groups of nodes) which will be processed separately
in the subgraph creation of graph layout algorithm.

Dynamo.Graph.Workspaces.WorkspaceModel.computeUpstreamNodesWhenWorkspaceAdded(DynamoServices.WorkspacesModificationEventArgs)
Computes the upstream nodes when workspace is added. when a workspace is added (assuming that
all the nodes and its connectors were added successfully) compute the upstream cache for all
the frozen nodes.
args: The DynamoServices.WorkspacesModificationEventArgs instance containing the event data.

Dynamo.Graph.Workspaces.WorkspaceModel.GetSharedName
Gets appropriate name of workspace for sharing.

Dynamo.Graph.Workspaces.WorkspaceModel.SaveAs(System.String,ProtoCore.RuntimeCore,System.Boolean)
Save to a specific file path, if the path is null or empty, does nothing.
If successful, the CurrentWorkspace.FilePath field is updated as a side effect
newPath: The path to save to
core:
isBackup: Indicates whether saved workspace is backup or not. If it's not backup,
we should add it to recent files. Otherwise leave it.

Dynamo.Graph.Workspaces.WorkspaceModel.AddAndRegisterNode(Dynamo.Graph.Nodes.NodeModel,System.Boolean)
Adds a node to this workspace.

Dynamo.Graph.Workspaces.WorkspaceModel.RemoveNode(Dynamo.Graph.Nodes.NodeModel)
Removes a node from this workspace.
This method does not raise a NodesModified event. (LC notes this is clearly not true)
model:

Dynamo.Graph.Workspaces.WorkspaceModel.DoGraphAutoLayout
This function wraps a few methods on the workspace model layer
to set up and run the graph layout algorithm.

Dynamo.Graph.Workspaces.WorkspaceModel.GenerateCombinedGraph(System.Boolean)
This method extracts all models from the workspace and puts them
into the combined graph object, LayoutSubgraphs.First()
isGroupLayout: True if all the selected models are groups.

Dynamo.Graph.Workspaces.WorkspaceModel.RecordUndoGraphLayout(System.Boolean)
This method adds relevant models to the undo recorder.
isGroupLayout: True if all the selected models are groups.

Dynamo.Graph.Workspaces.WorkspaceModel.GenerateSeparateSubgraphs(System.Collections.Generic.HashSet{GraphLayout.Node})
This method repeatedly takes a selected node in the combined graph and
uses breadth-first search to find all other nodes in the same subgraph
until all selected nodes have been processed.
nodes: A cluster of nodes to be separated into subgraphs.

Dynamo.Graph.Workspaces.WorkspaceModel.RunLayoutSubgraph(GraphLayout.Graph,System.Boolean)
This function calls the graph layout algorithm methods.
graph: The subgraph to be processed.
isGroupLayout: True if all selected models are groups.

Dynamo.Graph.Workspaces.WorkspaceModel.AvoidSubgraphOverlap
This method repeatedly shifts subgraphs away vertically from each other
when there are any two nodes from different subgraphs overlapping.

Dynamo.Graph.Workspaces.WorkspaceModel.SaveLayoutGraph
This method pushes changes from the GraphLayout.Graph objects
back to the workspace models.

Dynamo.Graph.Workspaces.WorkspaceModel.annotationModel_GetModelBase(System.Guid)
Get the model from Workspace
modelGuid: The model unique identifier.
Returns:

Dynamo.Graph.Workspaces.WorkspaceModel.CheckIfModelExistsInSameGroup(System.Collections.Generic.IEnumerable{Dynamo.Graph.Nodes.NodeModel},System.Collections.Generic.IEnumerable{Dynamo.Graph.Notes.NoteModel})
Checks if model exists in same group.
selectNodes: The select nodes.
selectNotes: The select notes.
Returns: true if the models are already in the same group

Dynamo.Graph.Workspaces.WorkspaceModel.Save(ProtoCore.RuntimeCore)
Save assuming that the Filepath attribute is set.

Dynamo.Graph.Workspaces.WorkspaceModel.GetSourceNodes
Return the nodes in the graph that have no inputs or have none of their inputs filled
Returns:

Dynamo.Graph.Workspaces.WorkspaceModel.AddPresetCore(System.String,System.String,System.Collections.Generic.IEnumerable{Dynamo.Graph.Nodes.NodeModel})
this method creates a new preset state from a set of NodeModels and adds this new state to this presets collection
name: the name of preset state
description: a description of what the state does
currentSelection: a set of NodeModels that are to be serialized in this state
id: a GUID id for the state, if not supplied, a new GUID will be generated, cannot be a duplicate

Dynamo.Graph.Workspaces.WorkspaceModel.IsInternalNodeToCodeConnection(System.Collections.Generic.IEnumerable{Dynamo.Graph.Nodes.NodeModel},Dynamo.Graph.Connectors.ConnectorModel)
Checks whether the given connection is inside the node to code set or outside it.
This determines if it should be redrawn(if it is external) or if it should be
deleted (if it is internal)

Dynamo.Graph.Workspaces.WorkspaceModel.ReConnectOutputConnections(System.Collections.Generic.Dictionary{Dynamo.Graph.Connectors.ConnectorModel,System.String},Dynamo.Graph.Nodes.CodeBlockNodeModel)
Forms new connections from the external nodes to the Node To Code Node,
based on the connectors passed as inputs.
externalOutputConnections: List of connectors to remake, along with the port names of the new port
cbn: The new Node To Code created Code Block Node

Dynamo.Graph.Workspaces.WorkspaceModel.ReConnectInputConnections(System.Collections.Generic.Dictionary{Dynamo.Graph.Connectors.ConnectorModel,System.String},Dynamo.Graph.Nodes.CodeBlockNodeModel)
Forms new connections from the external nodes to the Node To Code Node,
based on the connectors passed as inputs.
externalInputConnections: List of connectors to remake, along with the port names of the new port
cbn: The new Node To Code created Code Block Node

Dynamo.Graph.Workspaces.WorkspaceModel.ZoomChanged
Event that is fired every time the zoom factor of a workspace changes.

Dynamo.Graph.Workspaces.WorkspaceModel.WorkspaceSaved
Event that is fired when the workspace is saved.

Dynamo.Graph.Workspaces.WorkspaceModel.Notes
All of the notes currently in the workspace.

Dynamo.Graph.Workspaces.WorkspaceModel.X
Get or set the X position of the workspace.

Dynamo.Graph.Workspaces.WorkspaceModel.Y
Get or set the Y position of the workspace

Dynamo.Graph.Workspaces.WorkspaceModel.Height
Get the height of the workspace's bounds.

Dynamo.Graph.Workspaces.WorkspaceModel.Width
Get the width of the workspace's bounds.

Dynamo.Graph.Workspaces.WorkspaceModel.Rect
Get the bounds of the workspace.

Dynamo.Graph.Workspaces.WorkspaceModel.UndoRecorder
Get the current UndoRedoRecorder that is associated with the current
WorkspaceModel. Note that external parties should not have the needs
to access the recorder directly, so this property is exposed just as
a "temporary solution". Before using this property, consider using
WorkspaceModel.RecordModelsForUndo method which allows for multiple
modifications in a single action group.