Dynamo.Graph.Nodes.NodeModel.UpstreamCache
This property gets all the Upstream Nodes  for a given node, ONLY after the graph is loaded.
This property is computed in ComputeUpstreamOnDownstreamNodes function

Dynamo.Graph.Nodes.NodeModel.GetDescriptionStringFromAttributes
Get the description from type information
Returns: The value or "No description provided"

Dynamo.Graph.Nodes.NodeModel.GetDownstreamNodes(Dynamo.Graph.Nodes.NodeModel,System.Collections.Generic.HashSet{Dynamo.Graph.Nodes.NodeModel})
Gets the downstream nodes for the given node.
node: The node.
gathered: The gathered.

Dynamo.Graph.Nodes.NodeModel.GetValue(System.Int32,Dynamo.Engine.EngineController)
Gets the most recent value of this node stored in an EngineController that has evaluated it.
outPortIndex:
engine:
Returns:

Dynamo.Graph.Nodes.NodeModel.SetNickNameFromAttribute
Sets the nickname of this node from the attributes on the class definining it.

Dynamo.Graph.Nodes.NodeModel.AppendReplicationGuides(System.Collections.Generic.List{ProtoCore.AST.AssociativeAST.AssociativeNode})
Apppend replication guide to the input parameter based on lacing
strategy.
inputs:
Returns:

Dynamo.Graph.Nodes.NodeModel.HasInput(System.Int32)
Checks if there is an input for a certain port.
data: Index of the port to look for an input for.
Returns: True if there is an input, false otherwise.

Dynamo.Graph.Nodes.NodeModel.HasConnectedInput(System.Int32)
Checks if there is a connected input for a certain port. This does
not count default values as an input.
data: Index of the port to look for an input for.
Returns: True if there is an input, false otherwise.

Dynamo.Graph.Nodes.NodeModel.HasOutput(System.Int32)
Checks if there is an output for a certain port.
portData: Index of the port to look for an output for.
Returns: True if there is an output, false otherwise.

Dynamo.Graph.Nodes.NodeModel.ClearRuntimeError
Clears the errors/warnings that are generated when running the graph.
If the node has a value supplied for the persistentWarning, then the
node's State will be set to ElementState.Persistent and the ToolTipText will
be set to the persistent warning. Otherwise, the State will be
set to ElementState.Dead

Dynamo.Graph.Nodes.NodeModel.RegisterInputPorts
Reads inputs list and adds ports for each input.

Dynamo.Graph.Nodes.NodeModel.RegisterOutputPorts
Reads outputs list and adds ports for each output

Dynamo.Graph.Nodes.NodeModel.ConfigureSnapEdges(System.Collections.Generic.IList{Dynamo.Graph.Nodes.PortModel})
Configures the snap edges.
ports: The ports.

Dynamo.Graph.Nodes.NodeModel.GetDrawableIds
Gets list of drawable Ids as registered with visualization manager
for all the output port of the given node.
Returns: List of Drawable Ids

Dynamo.Graph.Nodes.NodeModel.GetDrawableId(System.Int32)
Gets the drawable Id as registered with visualization manager for
the given output port on the given node.
outPortIndex: Output port index
Returns: Drawable Id

Dynamo.Graph.Nodes.NodeModel.InPortData
Definitions for the Input Ports of this NodeModel.

Dynamo.Graph.Nodes.NodeModel.OutPortData
Definitions for the Output Ports of this NodeModel.

Dynamo.Graph.Nodes.NodeModel.IsUpstreamVisible
Returns whether the node aggregates its upstream connections
for visualizations.

Dynamo.Graph.Nodes.NodeModel.IsInputNode
Input nodes are used in Customizer and Presets. Input nodes can be numbers, number sliders,
strings, bool, code blocks and custom nodes, which don't specify path. This property
is true for nodes that are potential inputs for Customizers and Presets.

Dynamo.Graph.Nodes.NodeModel.OverrideNameWithNickName
Should we override the displayed name with this Node's NickName property?

Dynamo.Graph.Nodes.NodeModel.NickName
The name that is displayed in the UI for this NodeModel.

Dynamo.Graph.Nodes.NodeModel.Name
Name property
If the node has a name attribute, return it.  Otherwise return empty string.

Dynamo.Graph.Nodes.NodeModel.Description
Description of this Node.