Dynamo.Graph.UpdateValueParams.#ctor(System.String,System.String,ProtoCore.Namespace.ElementResolver)
propertyName: Name of the property whose value is to be updated.
This parameter cannot be empty or null.
propertyValue: Value of the named property whose value is to be
updated. This parameter can either be null or empty if the targeted property
allows such values.This value comes directly
from DynamoTextBox after user commits it. Overridden methods then use
a specific IValueConverter to turn this string into another data type
that it expects
elementResolver: responsible for resolving class namespaces