Dynamo.Graph.Nodes.Utilities.SaveTraceDataToXmlDocument(System.Xml.XmlDocument,System.Collections.Generic.IEnumerable{System.Collections.Generic.KeyValuePair{System.Guid,System.Collections.Generic.List{System.String}}})
Call this method to serialize given node-data-list pairs into an
XmlDocument. Serialized data in the XmlDocument can be loaded by a
call to LoadTraceDataFromXmlDocument method.
document: The target document to which the trade data
is to be written. This parameter cannot be null and must represent
a valid XmlDocument object.
nodeTraceDataList: A dictionary of node-data-list pairs
to be saved to the XmlDocument. This parameter cannot be null and
must represent a non-empty list of node-data-list pairs.

Dynamo.Graph.Nodes.Utilities.WrapText(System.String,System.Int32)
Gets words from text, e.g. ImportFromCSV to ("Import","From","CSV")
text: incoming string
maxCharacters: Max number of characters per row