Dynamo.Graph.Nodes.CodeBlockUtils.GetStatementVariables(System.Collections.Generic.IEnumerable{Dynamo.Graph.Nodes.Statement},System.Boolean)
Call this method to get a list of lists of variables defined in
the given set of Statement objects. This method is typically used
in conjunction with DoesStatementRequireOutputPort method.
statements: A list of Statement objects whose defined
variables are to be retrieved. This list can be empty but it cannot
be null.
onlyTopLevel: Set this parameter to false to retrieve
all variables defined in nested Statement objects.
Returns: Returns a list of lists of variables defined by the given
set of Statement objects.