Dynamo.Migration.MigrationManager.#ctor(Dynamo.Migration.MigrationManager.FutureFileCallback,Dynamo.Migration.MigrationManager.ObsoleteFileCallback)
The private constructor.

Dynamo.Migration.MigrationManager.AddMigrationType(Dynamo.Graph.Nodes.TypeLoadData)
Adds a new type containing Migration methods into this manager.
t:

Dynamo.Migration.MigrationManager.ProcessWorkspace(Dynamo.Graph.Workspaces.WorkspaceInfo,System.Xml.XmlDocument,System.Boolean,Dynamo.Graph.Nodes.NodeLoaders.NodeFactory)
Attempts to migrate a workspace to the current version of Dynamo.
workspaceInfo:
xmlDoc:
Returns:

Dynamo.Migration.MigrationManager.ProcessWorkspaceMigrations(System.Version,System.Xml.XmlDocument,System.Version)
Runs all migration methods found on the listed migration target types.
currentVersion:
xmlDoc:
workspaceVersion:

Dynamo.Migration.MigrationManager.GetBackupFolder(System.String,System.Boolean)
Call this method with a root directory path information, and then
a backup sub-directory will be created below it (if one does not
already exist).
baseFolder: This is a directory inside which a new
backup sub-directory will be created. If this paramter does not
represent a valid directory name, an exception will be thrown.
create: Set this parameter to false if the creation of
the backup sub-directory is not desired. Typically this means the
method is called from within a test case and it is only interested
in getting the resulting path back without actually creating a new
backup sub-directory.
Returns: Returns full path to the backup folder created.

Dynamo.Migration.MigrationManager.CreateFunctionNode(System.Xml.XmlDocument,System.Xml.XmlElement,System.Int32,System.String,System.String,System.String)
Call this method to create an empty DSFunction node that contains
basic function node information.
document: The XmlDocument to create the node in.
assembly: Name of the assembly that implements this
function.
nickname: The nickname to display on the node.
signature: The signature of the function.
Returns: Returns the XmlElement that represents a DSFunction node
with its basic function information with default attributes.

Dynamo.Migration.MigrationManager.CreateCustomNodeFrom(System.Xml.XmlDocument,System.Xml.XmlElement,System.String,System.String,System.String,System.Collections.Generic.List{System.String},System.Collections.Generic.List{System.String})
Create a custom node as a replacement for an existing node.
document:
srcElement:
id: The custom node id.
name: The custom node name.
description: The custom node's description.
inputs: A list of input names.
outputs: A list of output names.
Returns:

Dynamo.Migration.MigrationManager.CloneAndChangeName(System.Xml.XmlElement,System.String,System.String,System.Boolean)
Call this method to create a clone of the original XmlElement and
change its type at one go. This method preserves all the attributes
while updating only the type name.
element: The XmlElement to be cloned and the type name
updated.
type: The fully qualified name of the new type.
nickname: The new nickname, by which this node is known.
cloneInnerXml: Parameter indicating whether the inner xml of the original node should be cloned.
Returns: Returns the cloned and updated XmlElement.