Dynamo.Updates.DynamoLookUp.GetDynamoInstallLocations
Gets all dynamo install path on the system by looking into the Windows registry.
Returns: List of Dynamo install path

Dynamo.Updates.DynamoLookUp.LatestProduct
Gets the version of latest product