Dynamo.Engine.NodeToCode.INamingProvider.GetTypeDependentName(ProtoCore.Type)
Get a name for specified type. This name will be used as the prefix
for variable that created in node to code. It should return a empty
string if fails to generate one.
type:
Returns: