Dynamo.Scheduler.TimeStamp.op_GreaterThan(Dynamo.Scheduler.TimeStamp,Dynamo.Scheduler.TimeStamp)
The public usage of time stamps should be restricted to these
methods used to ensure an ordering on timestamps
timeStamp0: The first time stamp in comparison.
timeStamp1: The second time stamp in comparison.
Returns: Return true if the first time stamp was created later than
the second time steamp, or false otherwise.

Dynamo.Scheduler.TimeStamp.op_LessThan(Dynamo.Scheduler.TimeStamp,Dynamo.Scheduler.TimeStamp)
The public usage of time stamps should be restricted to these
methods used to ensure an ordering on timestamps
timeStamp0: The first time stamp in comparison.
timeStamp1: The second time stamp in comparison.
Returns: Return true if the first time stamp was created earlier than
the second time steamp, or false otherwise.