Dynamo.Search.SearchDictionary`1.ByTag(System.String)
Get the elements with a given tag
tag:  The tag to match
Returns:  The elements with the given tag

Dynamo.Search.SearchDictionary`1.MatchWithQueryString(System.String,System.String[])
Check if key matches with query string. The query string could
contains multiple sub query strings which are separated with
space character. The function returns true if the key sequentially
matches with each sub query strings. E.g.,
"Autodesk.Geometry.Point.ByCoordinate" matches with query string
"geometry point by".
key:
pattern:
Returns:

Dynamo.Search.SearchDictionary`1.Search(System.String,System.Int32)
Search for elements in the dictionary based on the query
query:  The query
minResultsForTolerantSearch: Minimum number of results in the original search strategy to justify doing more tolerant search

Dynamo.Search.SearchDictionary`1.GetTags(`0)
Get all tags for search specified element
element: The element to match
Returns: All tags of the given element