Dynamo.Properties.Resources.CustomNodeNotLoaded
Looks up a localized string similar to Custom node definition is not loaded!.

Dynamo.Properties.Resources.DisplayEngineFailureMessageDescription
Looks up a localized string similar to The virtual machine that powers Dynamo is experiencing some unexpected errors internally and is likely "having great difficulties pulling itself together. It is "recommended that you save your work now and reload the file. Giving the Dynamo VM a new lease of life can potentially make it feel happier and behave better.
If you don't mind, it would be helpful for you to send us your file. That will make it quicker for us to get these issues fixed..

Dynamo.Properties.Resources.GroupDefaultText
Looks up a localized string similar to <Click here to edit the group title>.

Dynamo.Properties.Resources.NoBinFolder
Looks up a localized string similar to {0} contains a package without a bin folder.  Ignoring it..

Dynamo.Properties.Resources.NothingIsSelectedWarning
Looks up a localized string similar to Nothing is selected..

Dynamo.Properties.Resources.RangePortDataAmountToolTip
Looks up a localized string similar to Amount of numbers in the sequence
Default value: 10.

Dynamo.Properties.Resources.RangePortDataSeqToolTip
Looks up a localized string similar to New sequence.

Dynamo.Properties.Resources.UsageReportingErrorMessage
Looks up a localized string similar to Uh oh...
We're sorry - we tried to save your decisions, but something went wrong. The decision probably hasn't been saved. This really shouldn't have happened. Please get in touch via GitHub and send us this information.
You can also try deleting [FILEPATH] and trying again.
Depending on your previous choice, instrumentation may still be running, if you're worried about this, please consider not using Dynamo until we've got back to you to solve the problem.
Sorry about that..

Dynamo.Properties.Resources.WatermarkLabelText
Looks up a localized string similar to Your code goes here.