Dynamo.Engine.CodeCompletion.CodeCompletionServices.GetCompletionsOnType(System.String,System.String,ProtoCore.Namespace.ElementResolver)
Determines if the completion string is a valid type and
enumerates the list of completion members on the type
code:  code typed in the code block
stringToComplete:  Class name or declared variable
Returns:  list of method and property members of the type

Dynamo.Engine.CodeCompletion.CodeCompletionServices.GetFunctionSignatures(System.String,System.String,System.String,ProtoCore.Namespace.ElementResolver)
Returns the list of function signatures of all overloads of a given method
code:  code being typed in code block
functionName:  given method name for which signature is queried
functionPrefix:  class name in case of constructor or static method, OR
declared instance variable on which method is invoked
Returns:  list of method overload signatures