Dynamo.Engine.FunctionDescriptor.Assembly
Full path to the assembly the defined this function

Dynamo.Engine.FunctionDescriptor.ClassName
Class name of this function. If the functino is global function,
return String.Empty.