Dynamo.Logging.StabilityTracking
Stability state tracking utils library
The primary use is for reporting MTBF to instrumentation

Dynamo.Logging.StabilityTracking.NotifyCrash
Notify the stability tracker that a crash has occured