Dynamo.Engine.FunctionGroup.AddFunctionDescriptor(Dynamo.Engine.FunctionDescriptor)
Add a function descriptor to the group
function:
Returns:

Dynamo.Engine.FunctionGroup.GetFunctionDescriptor(System.String)
Get function descriptor from mangled function name
managledName:
Returns: