Dynamo.Graph.Nodes.NodeModel.GetCachedValueFromEngine(Dynamo.Engine.EngineController)
WARNING: This method is meant for unit test only. It directly accesses
the EngineController for the mirror data without waiting for any
possible execution to complete (which, in single-threaded nature of
unit test, is an okay thing to do). The right way to get the cached
value for a NodeModel is by going through its RequestValueUpdateAsync
method).
engine: Instance of EngineController from which the node
value is to be retrieved.
Returns: Returns the MirrorData if the node's value is computed, or
null otherwise.

Dynamo.Graph.Nodes.NodeModel.RaisePortConnectedEvent(Dynamo.Graph.Nodes.PortModel,Dynamo.Graph.Connectors.ConnectorModel)
This method to be called by the ports to raise the PortConnected event.
port:
connector:

Dynamo.Graph.Nodes.NodeModel.RaisePortDisconnectedEvent(Dynamo.Graph.Nodes.PortModel)
This method to be called by the ports to raise the PortDisconnected event.
port:

Dynamo.Graph.Nodes.NodeModel.RequestValueUpdateAsync(Dynamo.Scheduler.IScheduler,Dynamo.Engine.EngineController)
Call this method to asynchronously update the cached MirrorData for
this NodeModel through DynamoScheduler. AstIdentifierForPreview is
being accessed within this method, therefore the method is typically
called from the main/UI thread.