Dynamo.Core.CustomNodeManager.TryGetFunctionWorkspace(System.Guid,System.Boolean,Dynamo.Graph.Workspaces.ICustomNodeWorkspaceModel@)
Gets the function workspace.
id: The identifier.
isTestMode: if set to true [is test mode].
ws: The workspace.
Returns: